Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationHangerCannotBeSloped Property
 A hanger cannot be sloped or placed on a sloped element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationHangerCannotBeSloped { get; }
Public Shared ReadOnly Property FabricationHangerCannotBeSloped As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationHangerCannotBeSloped {
	FailureDefinitionId^ get ();
}
static member FabricationHangerCannotBeSloped : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace